Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_gc01_cult/pic32ck_gc01_cult_getting_started/firmware/src/packs/PIC32CK2051GC01144_DFP/component/dsu.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DSU register API structure */
typedef struct
{  /* Device Service Unit */
  __O   uint32_t                       DSU_CTRL;           /**< Offset: 0x00 ( /W  32) Control */
  __IO  uint32_t                       DSU_ADDR;           /**< Offset: 0x04 (R/W  32) Address */
  __IO  uint32_t                       DSU_LENGTH;         /**< Offset: 0x08 (R/W  32) Length */
  __IO  uint32_t                       DSU_DATA;           /**< Offset: 0x0C (R/W  32) Data */
  __IO  uint32_t                       DSU_CFG;            /**< Offset: 0x10 (R/W  32) Configuration */
  __IO  uint32_t                       DSU_MBFI0;          /**< Offset: 0x14 (R/W  32) Memory Bist Fault Injection 0 */
  __IO  uint32_t                       DSU_MBFI1;          /**< Offset: 0x18 (R/W  32) Memory Bist Fault Injection 1 */
  __I   uint8_t                        Reserved1[0xE4];
  __IO  uint32_t                       DSU_STATUSA;        /**< Offset: 0x100 (R/W  32) Status A */
  __I   uint32_t                       DSU_STATUSB;        /**< Offset: 0x104 (R/   32) Status B */
  __I   uint32_t                       DSU_STATUSC;        /**< Offset: 0x108 (R/   32) Status C */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       DSU_BCC[2];         /**< Offset: 0x110 (R/W  32) Boot ROM Communication Channel x */
  __IO  uint32_t                       DSU_DCC[2];         /**< Offset: 0x118 (R/W  32) Debug Communication Channel x */
  __I   uint32_t                       DSU_DID;            /**< Offset: 0x120 (R/   32) Device Identification */
  __I   uint32_t                       DSU_DAL;            /**< Offset: 0x124 (R/   32) Debugger Access Level */
  __I   uint8_t                        Reserved3[0xED8];
  __I   uint32_t                       DSU_ENTRY[8];       /**< Offset: 0x1000 (R/   32) Coresight ROM Table Entry x */
  __I   uint8_t                        Reserved4[0xFAC];
  __I   uint32_t                       DSU_MEMTYPE;        /**< Offset: 0x1FCC (R/   32) Coresight ROM Table Memory Type */
  __I   uint32_t                       DSU_PID4;           /**< Offset: 0x1FD0 (R/   32) Coresight ROM Table Peripheral Identification 4 */
  __I   uint32_t                       DSU_PID5;           /**< Offset: 0x1FD4 (R/   32) Coresight ROM Table Peripheral Identification 5 */
  __I   uint32_t                       DSU_PID6;           /**< Offset: 0x1FD8 (R/   32) Coresight ROM Table Peripheral Identification 6 */
  __I   uint32_t                       DSU_PID7;           /**< Offset: 0x1FDC (R/   32) Coresight ROM Table Peripheral Identification 7 */
  __I   uint32_t                       DSU_PID0;           /**< Offset: 0x1FE0 (R/   32) Coresight ROM Table Peripheral Identification 0 */
  __I   uint32_t                       DSU_PID1;           /**< Offset: 0x1FE4 (R/   32) Coresight ROM Table Peripheral Identification 1 */
  __I   uint32_t                       DSU_PID2;           /**< Offset: 0x1FE8 (R/   32) Coresight ROM Table Peripheral Identification 2 */
  __I   uint32_t                       DSU_PID3;           /**< Offset: 0x1FEC (R/   32) Coresight ROM Table Peripheral Identification 3 */
  __I   uint32_t                       DSU_CID0;           /**< Offset: 0x1FF0 (R/   32) Coresight ROM Table Component Identification 0 */
  __I   uint32_t                       DSU_CID1;           /**< Offset: 0x1FF4 (R/   32) Coresight ROM Table Component Identification 1 */
  __I   uint32_t                       DSU_CID2;           /**< Offset: 0x1FF8 (R/   32) Coresight ROM Table Component Identification 2 */
  __I   uint32_t                       DSU_CID3;           /**< Offset: 0x1FFC (R/   32) Coresight ROM Table Component Identification 3 */
} dsu_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CKGC01_DSU_COMPONENT_H_ */
